In [1]:
import pandas as pd

In [8]:
df=pd.DataFrame({'A':[1,2,3],'B':[10,20,30]},index=['a','b','c'])

In [14]:
df1=pd.DataFrame({'C':[4,5,6],'D':[40,50,60]},index=['a','b','c'])

In [15]:
display(df)

   A   B
a  1  10
b  2  20
c  3  30

In [16]:
display(df,df1)  #displying dataframes

   A   B
a  1  10
b  2  20
c  3  30

   C   D
a  4  40
b  5  50
c  6  60

In [17]:
df.join(df1)  #using join function, order can be changed by changing position
#it wont change if indeices of both DFs are not same

   A   B  C   D
a  1  10  4  40
b  2  20  5  50
c  3  30  6  60